class Solution:
    def firstUniqChar(self, s: str) -> int:
        count = {}
      # Цикл for для обрахування кількості кожної букви в строці 
        for c in s:
            count[c] = count.get(c, 0) + 1
        # Ще один цикл for, але вже для того щоб натйи перше число, яке не повторюється, enumerate це команда яка проходиться по кожному символу і  його індексу
        for i, c in enumerate(s):
          # Якщо кількість повторів символа дорівнює 1, повертаєм індекс символа(Букви)
            if count[c] == 1:
                return i
        # Повертаєм -1 якщо не надено числа, яке повторюється
        return -1
