class Solution:
  # Початок функції
    def missingNumber(self, nums: List[int]) -> int:
      # Створюєм зміну n, яка дорівнює кількості чисел в списку
        n = len(nums)
      # Створюєм змінну, в якій значення суми всіх чисел, яка мало би бути при повному списку із числом, якого не вистарчає
        expected_sum = (n*(n + 1)) //2
      # Створюєм змінну з реальною сумою всіх чисел
        real_sum = sum(nums)
      # Повертаєм їхню різницю, яка дорівнює числу, якого не вистарчає у списку nums
        return (expected_sum - real_sum)
