class Solution:
  # Початок функції
    def singleNumber(self, nums: List[int]) -> int:
      # Створюєм змінну зі значенням 0 для циклу for зі XOR
        result = 0
        for num in nums:
          # Кожне елемент списку проходить через XOR
            result ^= num
          # Повертаєм результат
        return result
      # XOR: Якщо чило помножити саме на себе вийде нуль, якщо помножити на 0 вийде задане число. Базується на двоїчному коді: 0 ^ 4 = 4, 4 ^ 1 = 5, 5 ^ 2 = 7, 7 ^ 1 = 6, 6 ^ 2 = 4 (наприклад: 0100(4)^0001(1)=0101(5))
      # Розпитував ChatGPT як працює XOR
